# Вводятся два целых числа.
# Проверить делится ли первое на второе.
# Вывести на экран сообщение об этом, а также остаток (если он есть)
# и частное (в любом случае).

x = int(input('number '))
y = int(input('number '))
print(x/y)
if x / y:
    print("Congratulatiun")
